{"tweet": "@TRUMP_ARMY_ He is a shame to the Republican party. He should be out of that office now."}
{"tweet": "@BarronTrumpoo I stand with Trump!"}
{"tweet": "@DefiantLs Trump is Hammering the DemocRats and Criminals, all across the country....!!!"}
{"tweet": "@DerrickEvans4WV I’m sorry but  I don’t see any windows broken or Capitol Police being hit upside the head with Flag poles or being shot in the face with Bear spray—- oh that  is right that was Jan6 with Trump supporters"}
{"tweet": "@StM_1979 @krassenstein Except this was Canada’s plan for December: https://t.co/4O8TCXHJ1O………… Trump said no to it then, but backed down after the retaliatory tariffs and stock market crashed.    \n\n☝️ It was never about the borders. Trump is a liar &amp; his followers are brainwashed"}
{"tweet": "@lisamurkowski Ur a coward PoS💩Lisa. Ur too scared of that insurrectionist illegitimate @POTUS felon rapist to say the truth, ‘u Trump don’t know how tariffs work’! U can put ur tongue back Boo bcuz that name Denali is gone.. Trump’s revenge! @SenWarren @AKNewsNow https://t.co/gd6OcS8hks"}
{"tweet": "@ProjectLincoln You guys have such TDS\n\nTrump clearly WON !"}
{"tweet": "@CestSam @feelflix_ @Breaking911 He wants free trade and access to US markets. He is growing his textile industry with the prison force. He needs markets to compete in vs China. He has the prison system down. It is brilliant on both ends. Trump finds a replacement for low cost goods, hurts China. https://t.co/gKk6y5VrTz"}
{"tweet": "$Rio The Rio Meme Coin HAS BEEN OFFICIALLY DROPPED!! 🔥🔥\n\nhttps://t.co/2pBzy426Md\n\n4cHKTeaj5FGLef6rNLWXrHsq1fYUKkx4kWQ2dSMppump\n\n$RedBull $HOOD $ALPHA $MCVALUE $JAI $MWG $BFC $1DOLLAR $AMZN $ONION $FARTCOIN $DOGEMARS $COKE $SNAI $AMAI $TRUMP $SOL $SOLANA $BTC $CRYPTO $LUX $SWF… https://t.co/pSP8YPVG2z"}
{"tweet": "Both in Australia and internationally we’re witnessing a growth in the far right - epitomised by Donald Trump in America but increasingly also by Peter Dutton’s openly bigoted Liberal Party here."}
